// 从n个数中选出m个(m <= n)元素,按照一定顺序排列起来.当m = n时的所有排列情况叫做全排列.
// 比如:1 2 3的全排列为:
// 123 132 213 231 312 321
 
#include <iostream>
 
using namespace std;
int a[100]; //用于存放每次排列的结果
 
void dfs(int cur, int n)
{
    int i = 0;
    int j = 0;
    // 达到递归边界,说明已经填完了.输出当前的排列结果
    if(cur == n)
    {
        for(i = 0; i < n; i++)
        {
            cout << a[i] << " ";
        }
        cout << endl;
    }
 
    // 将数字1-n填入数组a中
    for(i = 1; i <= n; i++)
    {
        int ok = 1;
 
        // 判断当前的元素是否被使用.
        for(j = 0; j < cur; j++)
        {
            if(a[j] == i)
                ok = 0;
        }
 
        //如果没有使用
        if(ok)
        {
            a[cur] = i;//将元素i填到第cur个坑
            dfs(cur+1, n);//然后递归填第cur+1个坑
        }
    }
 
}
 
int main()
{
    // 首先有几个坑就会递归几层.
    // cur为当前正在装填第几个坑.n为一共有几个元素(几个坑)
    // 首先遍历1--n,然后开始填坑.第一次会填第一个坑,也就会出现n种情况
    // 递归填第二个坑,继续循环1--n,排除之前使用过的元素,也就会产生n-1种情况.
    // 递归填第三个坑,继续循环1--n,排除之前使用过的元素,也就会产生n-2种情况.
    // .....
    dfs(0, 3);
    return 0;
}